# 관련 패키지 로드
library(readxl)
library(writexl)
library(lubridate)
library(dplyr)
library(data.table)

# Excel 파일 불러오기_readxl
obs0509 <- read_excel("D:/1. 수질총량/3. 목표수질/총량측정망 수질 현황 정리/총량측정망 수질/전체 총량측정망/수질_총량측정망_200501-200912.xls", skip = 2) %>% 
  select(총량지점명, 일자, "BOD(㎎/L)", "총인(T-P)(㎎/L)", "유량(㎥/s)")
obs1014 <- read_excel("D:/1. 수질총량/3. 목표수질/총량측정망 수질 현황 정리/총량측정망 수질/전체 총량측정망/수질_총량측정망_201001-201412.xls", skip = 2) %>% 
  select(총량지점명, 일자, "BOD(㎎/L)", "총인(T-P)(㎎/L)", "유량(㎥/s)")
obs1518 <- read_excel("D:/1. 수질총량/3. 목표수질/총량측정망 수질 현황 정리/총량측정망 수질/전체 총량측정망/수질_총량측정망_201501-201812.xls", skip = 2) %>% 
  select(총량지점명, 일자, "BOD(㎎/L)", "총인(T-P)(㎎/L)", "유량(㎥/s)")
obs1900 <- read_excel("D:/1. 수질총량/3. 목표수질/총량측정망 수질 현황 정리/총량측정망 수질/전체 총량측정망/수질_총량측정망_201901-202010.xls", skip = 2) %>% 
  select(총량지점명, 일자, "BOD(㎎/L)", "총인(T-P)(㎎/L)", "유량(㎥/s)")

# 자료 합치기
obs <- rbind(obs0509, obs1014, obs1518, obs1900)

# 변수명 변경(R 변수명 규칙에 맞게 조정)_data.table
setnames(obs, c("BOD(㎎/L)", "총인(T-P)(㎎/L)", "유량(㎥/s)"), c("BOD", "TP", "유량"))

# 날짜 형식 변경
obs$일자 <- gsub("\\.", "-", obs$일자)

# 문자열로 표현된 날짜를 Date 객체로 변환_lubridate
obs$일자 <- as.Date(obs$일자, "%Y-%m-%d")

# 연도 추가_dplyr
obs <- obs %>% mutate(연도 = year(obs$일자))

# 한강수계 및 낙본A 만 필터_dplyr
obs <- obs %>% 
  filter(총량지점명 %in% c("골지A","오대A","주천A","평창A","옥동A","한강A","한강B","제천A","한강C","달천A",
                           "달천B","한강D","섬강A","섬강B","청미A","양화A","복하A","한강E","흑천A","북한A",
                           "북한B","소양A","인북A","소양B","북한C","가평A","홍천A","북한D","조종A","경안A",
                           "경안B","한강F","왕숙A","한강G","탄천A","중랑A","한강H","안양A","한강I","굴포A",
                           "공릉A","임진A","한탄A","영평A","신천A","한탄B","문산A","임진B", "낙본A"))

# 엑셀 파일 내보내기_writexl
write_xlsx(obs, path = "D:/1. 수질총량/3. 목표수질/총량측정망 수질 현황 정리/총량측정망 수질/전체 총량측정망/총량측정망0520.xlsx")
